tingyouwu/8266libs/ESP8266CustomHTTPUpdateServer/src/ESP8266CustomHTTPUpdateServer.cpp
#include <Arduino.h>
#include <WiFiClient.h>
#include <WiFiServer.h>
#include <ESP8266WebServer.h>
#include <WiFiUdp.h>
#include "StreamString.h"
#include "ESP8266CustomHTTPUpdateServer.h"


static const char serverIndex[] PROGMEM =
"<!DOCTYPE html>\r\n\
 <html lang=\"en\">\r\n\
 <head>\r\n\
 <meta charset=\"UTF-8\">\r\n\
 <title>ESP8266 WebOTA</title>\r\n\
 <style>\r\n\
 body{text-align: center;height: 100%;}\r\n\
 div,input{padding:5px;font-size:12px;}\r\n\
 input{width:95%;margin-top: 5px;}\r\n\
 button{padding:5px;border:0;border-radius:20px;background-color:#1fa3ec;color:#fff;line-height:30px;font-size:16px;width:100%;margin-top: 40px;}\r\n\
 .m-user-icon{width: 100px;height: 100px;border-radius: 50px}\r\n\
 .m-user-name{font-size: 18px;font-weight: bold;margin-top: 10px;}\r\n\
 .fileupload{position: relative;width:150px;height:25px;border:1px solid #66B3FF;border-radius: 4px;box-shadow: 1px 1px 5px #66B3FF;line-height: 25px;overflow: hidden;color: #66B3FF;;left: 50%;transform: translateX(-50%);text-overflow:ellipsis;white-space:nowrap}\r\n\
 .fileupload input{position: absolute;width:150px;height:25px;top: 0;left: 50%;transform: translateX(-50%);opacity: 0;filter: alpha(opacity=0);-ms-filter: 'alpha(opacity=0)';}\r\n\
 </style>\r\n\
 </head>\r\n\
 <body>\r\n\
 <div style=\"text-align:center;display:inline-block;min-width:260px;margin-top: 80px;\">\r\n\
 <div class=\"m-user\">\r\n\
