tingyouwu/8266libs/ESP8266CustomHTTPUpdateServer/src/ESP8266CustomHTTPUpdateServer.cpp
QCDEULGHbwCj4l4j6OL9ulP3N3EQugOdGp+Hmp9+/+5137p4cpgawhiED8Q+sgl/KZmkEWsT/Xwnfs1+bzSZ+hQK8pys7+X14EBsCeA5MC921ZPM0g3NyZMgqFk7Mx5D5ib9bqFfT+3m1KctMAHqnW0WXy+0Sh0f7lih2/+s9JuQfOAgLg2y0iedGAh6hW7ezI6N0I9oTsKFpEKuvUTZBAAwCeuaJzAkBiNHp8dVTUNvJr6WZAEQu4Wt98YJNs8nqjA/a+HYoVAxiR2Zhprq5OJWcQvAGykgCErrX04qK1aOEeWXglD4UyMce/gUXMPcxG8FPl9/xZc7mmsjvEIAWtmEchaImTtfO8WGrNsG3WEhAbwg0CwjzN7u3e3Ka0aZuUHCgVqYWO7s0ACEagE613V5bDAqcyeIRnbP8cilTWi9uYcoyU12bSlaiOTx8RQ3uJCQj4+8fQHFkxfqbmfh7BnpmeHERPZNgMnlb0QBeUHhfKDYE7oCBWmjNOT0omGiiYPHCJIkGgBTgQ/zi+nLwiP9DfJrRnGYkIaHWcLY0pA9AFa/ctdTG0xdyZm9ZnIsv0obw8iL+8UyoupbP1yTZMMYFRFcqGJApc8IG2DZSn+bwx1zIDL82cKfp/BgQE+fF/9WjqAdlGc10fVZ0vX0V7V55IbfKsedPQyBljytwuoIHAQaPv/CnhN7AB0ZjgCHYeOhRyo1IopBQj8X8Fw6vGmwxdxj8Czd11kMZZJ70fj2vRiUkHk4O5CuKGNZOkmH9XOMHPgSwj0aPNrlWdMwCPvXmgJmMnLeBKFbLWfrJFDYhfiE6TETmeAiQfH/zw3QFZBTHUY38Q+h5uZVrvIxPtgGDAgop0XV75zYISG8idSY9Qhwn463hJJoqZpD5Q8vdq1c2t9Ko5QKyka2gc4kwjqXql5CO8zMzWwCSxYajMyZY+5kAigdW4b0cLUezpgs4KZcQI7gkiXIg4hTKtN6C/4wE+I4EHLeXYfRrgyxLdqSgrOAU3R2lXVweKyQrKi9grhsuFop8IXMT+NvVah3tsut4+nrmPHUAO6FD4GdfpxA//Fc3ikTvRM5BU1p3LGwwG1n8XkBGAqSsBQrlgBqLhSfRzhK9hi6cdYrbLQkCmOlDAF7g6tjMtG8a/NLSEn1jCjwRvz11IpQupNSmWnE7Zx1KIdRtu9ollJyh5UIxuYOZeS4b2IkajdoPirEaTgE6sx7/BYSPdVpJdgg8zggjNGmLwwR+GA2BEWaiOHDySL3OyPjTb6BT1YWRp/0xpSWZYYzf60OPDtD+nxG6bl4YJGCgUQzZ19vzzglzQ3Xzk0Lh6sxht7hM1QWKzamkIuVkXwDfJFnLnBq8HgHg772s+ldXcwHl6aepTXbcZuBArPPDjGRmebvisvtxqydpH4+8ccXgJFpmj8cUeZX4YT6LNOuf324tvbz0b3qNGx+LZckCYxKwoISmH0Js/MIRs7chuOP8Chx/d/GhEvJSiOaKalS+YMyXkKIq+LGVoeNrR5l0/gvwgfWvZss117j/FvstTz9yy6TPZDKCnXKQxn/Kak5NpjbG43E+6Iq5I9dG4g8/ePeVb/MJWXsHgN8nRW6+zCl7l5Yk4OrgPcOfA16if1XTMEEmCa7JkVVv1ulyiiuI3NJDy6USdpDShfqU+rIRcetrqVEO7g87i/bwiL+//4hfdyA4hzqVCrrmn0QjpRefgQDu1Au05kBMgC+nbKRw3gf8brfIC3PjT6NXz/URrAMgcHIysMDv4XmH5LUwXF+PvCfAi4UwnZ8SF/2tLMwOIW3ENnhxayGzcIhdyZVCmjJnJXpyjBKPFOWMxH/KWRo/bmVjC547xdinwxO/1Kyh2WrqstdfJHsybuDI9XX/MQHfhVPofv88LlPxTkTB+C133/3w4Ijks5izgYoazXqBg1JIkixwE+ADjfORFNge/cXSG8rBHFEfDQL4HYPWbLOy+ZDd1cX6ILbEqvU8yqGpWjnAjbFOt6AHv9ZJBr87n92i5Yzg1wygnLep7hQXb38K8JoAX/8p0AZ68HPytuiyI7TnF29HM9SwiLXzp1EMDWCW4PPmavUdpdnIeuHcuvk4bu+rr77dw7e9Jfa1Z9kDbg7/ZVln1+PA6jjH5klulUIbwW4GmafTXpz6U02oB4F77on6BogdsQsKwsdwSMLIWRgUUtCneQ9LMVyjrLpSV32G9mdMwzOzBko6FzADvxpzz83ZU6mbx4U40pAqCrMeK9IXQZWx2KmWcw0djIMZT3719dcffGscRVGzpxsENASnkCNqYmcRkM15ZsPFUIZKnu5h5uotOH7+nqjcjB7k64Jss/afyvjZxWvkIJsiOGdH2Rye+AlecxHsHCnFG7747DNNwOu3nOMDvyYAMVRGhnNPT+PmgB/HmNxOvMplrLjQKi8EYLnE0Ww2wIXHTPR7P39NpwC/pcz7D35knaw3S+hH+A2HZ1YolGiyhZIHkbuyD/7tgOSTK6pk9Gn8ePiEP9Yfdgnx2UlUwRAA/9Hg8Y1QLQ01dfEXX3zGHOjeO+NDYDNp4oxcLhFzx4qY1/kRx/Y5j1ORacFrIgu3h4BADk8yBzIoAP63v9KZalzn+OkkTKdnRnHMbCkL/Ia1WcZ4rpUW6JWL7cdqaAv8tYAP0AZaKumfMAMcrkOONMqvrU/HL710ZFEYNaJ/yAVUMZMZWalglhNTN0DAZ5+9+PGdb8dpZt6waAoQAuVELajMOueLqWl/RBBkpH2EtSAzGjzVRjMRpSAwnTQCnx1nIQF7Y1il1ATQkja+ICDLbALv4TI80X9iAbbb7oQK9TQlnhaGkLl9v6GsSFjqRO6E7/crOLpmt782PL3hdvrGTu0Dm4l+toEWpij8s+WNG4D/+qd3vi2EabMd6Z0EIOCRoZQK78E8bN7vDHtkDk8/q9R3EnjqZI3ETgUb9y8vmfZ++u5r7UAUHQX8eQ/8Jwk/l0jIbASA32CGqUVysyjaqxmabC0vF/JTdXr6cqImsZwzpNRyicq2dArDx4IWfnRRfHJ6Os7zim2U6jcORZfBzPAhxixtJxHDn955i1MQ3X6/qDj0AYAfI8VWxOCGey5CjS1N2CPIiYtF2jzIwpqVqUqzuR3I7n313Rlf42ApSYBBwNgY8S9V1hcTXhJA1QMZ4c9kcJKsipI/s3tiLT+1E41ut1pKfQrTRbw1h5zl3E5lOzyA1HOK05Uqjs/N3nr7zXN4hALvBL8528JyAlxMjwMzyqXbX3/vFh5bQ7fgx+Z4HJimaJUEtiYDmHhMO+Oo/M1sc2/CU4spahneDyL1oNnAVAcXUr4++7uff9X5MQIfkICTnBRLbQRYAGSxmaPNZCozWJ6qpjqHmKzM0GSlIrekkz75nu1aQoEAE9eq1cRwzDZ0qlGoxNZTqdn4zSm/azpy6aAr2Hea2SsNnH8+Z/FyEKDFsi8q2p/GgoMbxdA4jyofM0Wd3+iLKpWYwwGf0neXJspKIpFrJpqsKm7Yogd/fvc1iH/++efv9DNdLA2dHDOe5GyeaNYCY/wOVkLnM7heWVqvHmZKrGTIV6LkOL5AYgdzCJnDi9+hiDgvazv1rBG3fzrlP2d9nQ9WnIOXbpyI9WGX/ZRzz+NezsEfCF6L4izK6OAGaqFxtBLz8zRt1PgpDR1UyjKHSWWusUoCrE3ynmYz1yBzqH9+Tfg/YVP25w+e0wcAAn46ef7YSRPYTcQvZYm/jJl8foZ2Vk50cGJvpbSyhskWO3V7gSQKnDGaCGAIOJ+YLHr6Tz1r2LnhH+c3iq6NIj964fR6TOlzCdbRUzlJMgz7KEx1M1lySrC44UYXt2efucXP8x6DHuDwt1Y0iyefTQSV3IS+sdrIKbVymSQ0/8DTf+7Xn3+ir1/B/zv7udFnfI08Cn5m5EHgh++rleTaFmXOTjXULWyugF+kGfoYeYGP89VqCYmuu1idDpyZGcZ5xfmNwjQOLrhHhu23z036/wIIgOQQKYJp3wAAAABJRU5ErkJggg==\">\r\n\
 <div class=\"m-user-name\">ESP8266 WebOTA更新</div>\r\n\
 </div>\r\n\
 <form method='POST' action='' enctype='multipart/form-data'>\r\n\
 <div class=\"fileupload\">\r\n\
 <script>\r\n\
 function getFilename(){\r\n\
 let filename=document.getElementById(\"file\").value;\r\n\
 if(filename===undefined||filename===\"\"){\r\n\
 document.getElementById(\"filename\").innerHTML=\"点击此处上传文件\";\r\n\
 } else{\r\n\
 let fn=filename.substring(filename.lastIndexOf(\"\\\")+1);\r\n\
 document.getElementById(\"filename\").innerHTML=fn; \r\n\
 }\r\n\
 }\r\n\
 </script>\r\n\
 <span id=\"filename\">点击选择新固件</span>\r\n\
 <input type=\"file\" name=\"file\" id=\"file\" onchange=\"getFilename()\"/>\r\n\
 </div>\r\n\
 <button type='submit'>确定更新</button>\r\n\
 </form>\r\n\
 <div style=\";margin-top: 10px;\">Copyright © 2019 By<a href='https://blog.csdn.net/wubo_fly'>单片机菜鸟</a></div>\r\n\
 </div>\r\n\
 </body>\r\n\
 </html>";
static const char successResponse[] PROGMEM = 
  "<META http-equiv=\"refresh\" content=\"15;URL=/\">Update Success! Rebooting...\n";

ESP8266CustomHTTPUpdateServer::ESP8266CustomHTTPUpdateServer(bool serial_debug)
{
  _serial_output = serial_debug;
  _server = NULL;
  _username = NULL;
  _password = NULL;
  _authenticated = false;
}

void ESP8266CustomHTTPUpdateServer::setup(ESP8266WebServer *server, const char * path, const char * username, const char * password)
{
    _server = server;
    _username = (char *)username;
    _password = (char *)password;

    // handler for the /update form page
    _server->on(path, HTTP_GET, [&](){
      if(_username != NULL && _password != NULL && !_server->authenticate(_username, _password))
        return _server->requestAuthentication();
      _server->send_P(200, PSTR("text/html"), serverIndex);
    });

    // handler for the /update form POST (once file upload finishes)
    _server->on(path, HTTP_POST, [&](){
      if(!_authenticated)
        return _server->requestAuthentication();
      if (Update.hasError()) {
        _server->send(200, F("text/html"), String(F("Update error: ")) + _updaterError);
      } else {
        _server->client().setNoDelay(true);
        _server->send_P(200, PSTR("text/html"), successResponse);
        delay(100);
        _server->client().stop();
        ESP.restart();
      }
    },[&](){
      // handler for the file upload, get's the sketch bytes, and writes
      // them through the Update object
      HTTPUpload& upload = _server->upload();

      if(upload.status == UPLOAD_FILE_START){
        _updaterError = String();
        if (_serial_output)
          Serial.setDebugOutput(true);

        _authenticated = (_username == NULL || _password == NULL || _server->authenticate(_username, _password));
        if(!_authenticated){
          if (_serial_output)
            Serial.printf("Unauthenticated Update\n");
          return;
        }

        WiFiUDP::stopAll();
        if (_serial_output)
          Serial.printf("Update: %s\n", upload.filename.c_str());
        uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
        if(!Update.begin(maxSketchSpace)){//start with max available size
          _setUpdaterError();
        }
      } else if(_authenticated && upload.status == UPLOAD_FILE_WRITE && !_updaterError.length()){
        if (_serial_output) Serial.printf(".");
        if(Update.write(upload.buf, upload.currentSize) != upload.currentSize){
          _setUpdaterError();
        }
      } else if(_authenticated && upload.status == UPLOAD_FILE_END && !_updaterError.length()){
        if(Update.end(true)){ //true to set the size to the current progress
          if (_serial_output) Serial.printf("Update Success: %u\nRebooting...\n", upload.totalSize);
        } else {
          _setUpdaterError();
        }
        if (_serial_output) Serial.setDebugOutput(false);
      } else if(_authenticated && upload.status == UPLOAD_FILE_ABORTED){
        Update.end();
        if (_serial_output) Serial.println("Update was aborted");
      }
      delay(0);
    });
}

void ESP8266CustomHTTPUpdateServer::_setUpdaterError()
{
  if (_serial_output) Update.printError(Serial);
  StreamString str;
  Update.printError(str);
  _updaterError = str.c_str();
}
